In [1]:
import pandas as pd
import numpy as np

In [2]:
r1 = [1,2,3,4]
r2 = [5,6,7,8]
r3 = [9,10,11,12]

df1 = pd.DataFrame({'row1':r1,'row2':r2,'row3':r3})
df1

   row1  row2  row3
0     1     5     9
1     2     6    10
2     3     7    11
3     4     8    12

In [3]:
df1.apply(lambda row: row['row1'], axis=1)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
df1.dtypes

row1    int64
row2    int64
row3    int64
dtype: object

In [5]:
r1 = [1,np.nan,2,3]
r2 = [4,5,np.nan,6]
r3 = [7,8,9,np.nan]

df2 = pd.DataFrame({'row1':r1,'row2':r2,'row3':r3})
df2

   row1  row2  row3
0   1.0   4.0   7.0
1   NaN   5.0   8.0
2   2.0   NaN   9.0
3   3.0   6.0   NaN

In [6]:
df2.dtypes

row1    float64
row2    float64
row3    float64
dtype: object

In [7]:
df2.apply(lambda row: row['row1'], axis=1)

0    1.0
1    NaN
2    2.0
3    3.0
dtype: float64

In [9]:
df2.dtypes

row1    float64
row2    float64
row3    float64
dtype: object

In [8]:
df2.apply(lambda row: row['row1'], axis=1, result_type='broadcast')

   row1  row2  row3
0   1.0   1.0   1.0
1   NaN   NaN   NaN
2   2.0   2.0   2.0
3   3.0   3.0   3.0

In [ ]:
df2['row1']  = df['row1'].astype('Int64')
df